docs/ChangeLog.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.57 in css mode. -->
<html>
  <head>
    <title>ChangeLog.org</title>
  </head>
  <body>
    <pre>
<span class="org-level-1">* ChangeLog</span>

<span class="org-level-2">** version 0.1</span>

<span class="org-level-3">*** </span><span class="org-date">[2022-09-07]</span><span class="org-level-3"> start this blog</span>
<span class="org-level-3">*** </span><span class="org-date">[2022-09-13]</span><span class="org-level-3"> add iframe, Responsive Web Support</span>
<span class="org-level-3">*** </span><span class="org-date">[2022-09-14]</span><span class="org-level-3"> add header footer</span>
<span class="org-level-3">*** </span><span class="org-date">[2022-09-22]</span><span class="org-level-3"> add twitter message link</span>
<span class="org-level-3">*** </span><span class="org-date">[2022-11-17]</span><span class="org-level-3"> add jscl repl</span>

<span class="org-level-2">** version 0.2 </span>

<span class="org-level-3">*** </span><span class="org-date">[2022-11-29 &#28779;]</span><span class="org-level-3"> top&#12506;&#12540;&#12472;&#12398;&#21047;&#26032;&#12392;menu&#12471;&#12473;&#12486;&#12512;&#12398;&#20999;&#12426;&#26367;&#12360;</span>
&#12459;&#12486;&#12468;&#12522;&#12540;&#12434;&#20998;&#12369;&#12390;&#12381;&#12428;&#12382;&#12428;&#12513;&#12491;&#12517;&#12540;&#12434;&#20316;&#12427;&#26041;&#27861;&#12434;&#24259;&#27490;&#12375;&#12289;
&#32113;&#21512;&#12513;&#12491;&#12517;&#12540;&#12398;&#12415;&#12395;&#20999;&#12426;&#26367;&#12360;&#12383;&#12290;

<span class="org-level-1">* todo</span>

<span class="org-level-2">** </span><span class="org-done">DONE</span><span class="org-level-2"> &#35079;&#25968;&#12513;&#12491;&#12517;&#12540;&#12398;&#38555;&#12395;&#12289;&#26368;&#24460;&#12398;&#12513;&#12491;&#12517;&#12540;&#12375;&#12363;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#35201;&#20462;&#27491;</span>
   <span class="org-special-keyword">CLOSED:</span> <span class="org-date">[2022-11-29 &#28779; 23:59]</span>
   make-link&#20869;&#12398;format&#25991;&#12391;nil&#25351;&#23450;&#12375;&#12383;&#12418;&#12398;&#12434;return&#12377;&#12427;&#12392;&#12289;
&#12523;&#12540;&#12503;&#12398;&#26368;&#24460;&#12398;&#12487;&#12540;&#12479;&#12375;&#12363;&#34920;&#31034;&#12373;&#12428;&#12390;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12289;loop&#12398;do&#12434;&#36766;&#12417;&#12390;collect&#12395;&#20999;&#12426;&#26367;&#12360;&#12383;&#12290;
   - State "DONE"       from "TODO"       <span class="org-date">[2022-11-29 &#28779; 23:59]</span>
   - State "TODO"       from              <span class="org-date">[2022-11-24 &#26408; 23:59]</span>
</pre>
  </body>
</html>
